[
  {
    "Id": 1,
    "Title": "7 Minute Abs Exercise",
    "Url": "https://www.youtube.com/watch?v=DHD1-2P94DI",
    "Img": "https://i.ytimg.com/vi/DHD1-2P94DI/sddefault.jpg",
    "Rating": 5,
    "Description": "If you want to develop six pack abs you may think that you have to spend hours a day trying to get one.  That is not the case at all.  If you are able to commit to a consistent but short effort you will be amazed at how much better your abs could look in a short period of time when combined with a focused attention to what you eat as well. In this video, I have a short 7 minute ab workout for you to do along with me.  As you will see and feel, an ab workout does not have to be long to be effective.  As a matter of fact, I would probably say that the longer the ab workout goes, the less effective it becomes.  The key to this working is that it is short enough to allow you to do it on a regular basis without having to fight to schedule it into your day. Remember, the key to getting a six pack is consistency.  Now, don’t think that just because you might be doing the same set of exercises that it is becoming less effective.  It is not.  The choice of ab exercises in this workout is broad enough so as to cover all of the major functions of the abs.  There are bottom up movements that better hit the lower abs.  There are rotational movements that are initiated from the bottom up and the top down to really hit the rotation capabilities of the core muscles."
  },
  {
    "Id": 2,
    "Title": "Best Diet For Weight Loss",
    "Url": "https://www.youtube.com/watch?v=LCyECbA3pUw",
    "Img": "https://i.ytimg.com/vi/LCyECbA3pUw/maxresdefault.jpg",
    "Rating": 4,
    "Description": "If you’ve attempted a weight loss diet plan of your own, then you’re probably aware that at the end of the day, weight loss is all about calories in versus calories out. Scientifically speaking this is the basic law of thermodynamics for any fat loss diet, but what this simplistic model fails to account for is how the various foods you put into your body then go about affecting these two variables. The truth is that you also need to pay close attention to the types of foods you’re ingesting everyday AND also how you go about ingesting them in your weight loss diet, as that’s what makes all the difference. In this video, I’ll go through how to eat to lose weight (with 3 diet swaps) that can enable you to lose fat faster, and provide you with a sample fat loss meal plan that puts this all together for you. "
  },
  {
    "Id": 3,
    "Title": "Protein: How to best use it?",
    "Url": "https://youtu.be/42PTdcxTfpc",
    "Img": "https://i.ytimg.com/vi/42PTdcxTfpc/maxresdefault.jpg",
    "Rating": 4,
    "Description": "Despite protein powder (or “protein shakes”) being by far the most widely consumed supplement within the fitness industry, most people are lost when it comes to how to choose the best type of protein and even moreso when it comes to how to best use protein powder to build muscle. In this video, I’ll cover everything you need to know about protein. That is not the case at all.  If you are able to commit to a consistent but short effort you will be amazed at how much better your abs could look in a short period of time when combined with a focused attention to what you eat as well. In this video, I have a short 7 minute ab workout for you to do along with me.  As you will see and feel, an ab workout does not have to be long to be effective.  As a matter of fact, I would probably say that the longer the ab workout goes, the less effective it becomes.  The key to this working is that it is short enough to allow you to do it on a regular basis without having to fight to schedule it into your day. Remember, the key to getting a six pack is consistency.  Now, don’t think that just because you might be doing the same set of exercises that it is becoming less effective.  It is not.  The choice of ab exercises in this workout is broad enough so as to cover all of the major functions of the abs.  There are bottom up movements that better hit the lower abs.  There are rotational movements that are initiated from the bottom up and the top down to really hit the rotation capabilities of the core muscles."
  },
  {
    "Id": 4,
    "Title": "How to train for body mass? - Arnold Schwarzenegger",
    "Url": "https://youtu.be/o9zCgPtsups",
    "Img": "https://i.ytimg.com/vi/o9zCgPtsups/maxresdefault.jpg",
    "Rating": 5,
    "Description": "When it comes to bodybuilding, Arnold Schwarzenegger knows best. His plan for quality mass and extreme strength isn't complicated. In fact, it's steeped in the fundamentals and old-school exercises that should be at the heart of everyone's program. It's a surefire road to growth, but it's fraught with pain and struggle. If you want to learn bodybuilding from the world's best bodybuilder, you're in the right place. That is not the case at all.  If you are able to commit to a consistent but short effort you will be amazed at how much better your abs could look in a short period of time when combined with a focused attention to what you eat as well. In this video, I have a short 7 minute ab workout for you to do along with me.  As you will see and feel, an ab workout does not have to be long to be effective.  As a matter of fact, I would probably say that the longer the ab workout goes, the less effective it becomes.  The key to this working is that it is short enough to allow you to do it on a regular basis without having to fight to schedule it into your day. Remember, the key to getting a six pack is consistency.  Now, don’t think that just because you might be doing the same set of exercises that it is becoming less effective.  It is not.  The choice of ab exercises in this workout is broad enough so as to cover all of the major functions of the abs.  There are bottom up movements that better hit the lower abs.  There are rotational movements that are initiated from the bottom up and the top down to really hit the rotation capabilities of the core muscles."
  },
  {
    "Id": 5,
    "Title": "Anabolic Lasagna Recepie",
    "Url": "https://www.youtube.com/watch?v=GTf2kYANSyU",
    "Img": "https://i.ytimg.com/vi/GTf2kYANSyU/maxresdefault.jpg",
    "Rating": 4,
    "Description": "THE ULIMATE ANABOLIC COOKBOOK 2.0 : https://bit.ly/35pUJu4 CHECK OUT MY TRAINING BOOK HARDER THAN LAST TIME!: https://bit.ly/38ysDix COACHING, PROGRAMS, MERCH & EVERYTHING!!!: https://bit.ly/39kl7H5INSTAGRAM ‣ http://instagram.com/gregdoucetteifbbpro, That is not the case at all.  If you are able to commit to a consistent but short effort you will be amazed at how much better your abs could look in a short period of time when combined with a focused attention to what you eat as well. In this video, I have a short 7 minute ab workout for you to do along with me.  As you will see and feel, an ab workout does not have to be long to be effective.  As a matter of fact, I would probably say that the longer the ab workout goes, the less effective it becomes.  The key to this working is that it is short enough to allow you to do it on a regular basis without having to fight to schedule it into your day. Remember, the key to getting a six pack is consistency.  Now, don’t think that just because you might be doing the same set of exercises that it is becoming less effective.  It is not.  The choice of ab exercises in this workout is broad enough so as to cover all of the major functions of the abs.  There are bottom up movements that better hit the lower abs.  There are rotational movements that are initiated from the bottom up and the top down to really hit the rotation capabilities of the core muscles."
  },
  {
    "Id": 6,
    "Title": "Are genetics killing your gains?",
    "Url": "https://www.youtube.com/watch?v=lEwTz1hDOGE",
    "Img": "https://i.ytimg.com/vi/lEwTz1hDOGE/maxresdefault.jpg",
    "Rating": 4,
    "Description": "Ever wondered if you have good enough genetics to actually build muscle? If so, this is the video you need to watch. Jeff Cavaliere and Jesse Laico dive into the viewer mailbox to answer the question of what can be done if your genetics for building muscle just aren’t so great. That is not the case at all.  If you are able to commit to a consistent but short effort you will be amazed at how much better your abs could look in a short period of time when combined with a focused attention to what you eat as well. In this video, I have a short 7 minute ab workout for you to do along with me.  As you will see and feel, an ab workout does not have to be long to be effective.  As a matter of fact, I would probably say that the longer the ab workout goes, the less effective it becomes.  The key to this working is that it is short enough to allow you to do it on a regular basis without having to fight to schedule it into your day. Remember, the key to getting a six pack is consistency.  Now, don’t think that just because you might be doing the same set of exercises that it is becoming less effective.  It is not.  The choice of ab exercises in this workout is broad enough so as to cover all of the major functions of the abs.  There are bottom up movements that better hit the lower abs.  There are rotational movements that are initiated from the bottom up and the top down to really hit the rotation capabilities of the core muscles."
  }
]
